In [1]:
import pandas as pd

In [2]:
a = ["Volvo", 'Kiaz', "CEAT", "RANGER", "ROVER"]

In [3]:
dt = pd.DataFrame(a)

In [4]:
dt

        0
0   Volvo
1    Kiaz
2    CEAT
3  RANGER
4   ROVER

In [5]:
print(dt[0])

0     Volvo
1      Kiaz
2      CEAT
3    RANGER
4     ROVER
Name: 0, dtype: object

In [6]:
dt = pd.Series(a, index = ["x", "y", "z","s", "t"])

In [7]:
dt

x     Volvo
y      Kiaz
z      CEAT
s    RANGER
t     ROVER
dtype: object

In [8]:
print(dt["t"])
print(dt["x"])
print(dt["z"])
print(dt["s"])

ROVER
Volvo
CEAT
RANGER

In [9]:
callories = {"day1": 500, "day2": 300, "day3": 525, "day4": 500, "day5": 100}

In [10]:
mycal = pd.Series(callories)
print(mycal)

day1    500
day2    300
day3    525
day4    500
day5    100
dtype: int64

In [11]:
mycal = pd.Series(callories, index=["day2"])
print(mycal)

day2    300
dtype: int64

# Data Frame

In [40]:
data = {
     "Monday": [420, 380, 390],
     "Tuesday": [150 , 420, 380],
     "Wednesday": [200, 420, 380],
     "Thursday": [500, 200, 420],
     "Friday": [500, 420, 380],
     "Saturday":[300, 200, 420],
     "Sunday":["Cheat Day"," FUnday", "CoolDay"]
}

In [41]:
df = pd.DataFrame(data)

In [42]:
df

   Monday  Tuesday  Wednesday  Thursday  Friday  Saturday     Sunday
0     420      150        200       500     500       300  Cheat Day
1     380      420        420       200     420       200     FUnday
2     390      380        380       420     380       420    CoolDay

In [17]:
df.describe()

       Monday  Tuesday  Wednesday  Thursday  Friday  Saturday
count     1.0      1.0        1.0       1.0     1.0       1.0
mean    460.0    150.0      200.0     500.0   500.0     300.0
std       NaN      NaN        NaN       NaN     NaN       NaN
min     460.0    150.0      200.0     500.0   500.0     300.0
25%     460.0    150.0      200.0     500.0   500.0     300.0
50%     460.0    150.0      200.0     500.0   500.0     300.0
75%     460.0    150.0      200.0     500.0   500.0     300.0
max     460.0    150.0      200.0     500.0   500.0     300.0

In [48]:
df.head()

   Monday  Tuesday  Wednesday  Thursday  Friday  Saturday     Sunday
0     420      150        200       500     500       300  Cheat Day
1     380      420        420       200     420       200     FUnday
2     390      380        380       420     380       420    CoolDay

In [56]:
print(df.loc[[0,1]])

   Monday  Tuesday  Wednesday  Thursday  Friday  Saturday     Sunday
0     420      150        200       500     500       300  Cheat Day
1     380      420        420       200     420       200     FUnday

In [58]:
df = pd.DataFrame(data, index=["Day1", "Day2", "Day3"])

In [59]:
df

      Monday  Tuesday  Wednesday  Thursday  Friday  Saturday     Sunday
Day1     420      150        200       500     500       300  Cheat Day
Day2     380      420        420       200     420       200     FUnday
Day3     390      380        380       420     380       420    CoolDay

In [62]:
print(df.loc["Day2"])

Monday           380
Tuesday          420
Wednesday        420
Thursday         200
Friday           420
Saturday         200
Sunday        FUnday
Name: Day2, dtype: object